#include "PW4.h"

#include <set>

/*---   Предварительное   ---*/
// Сумма значений std::set
int sumSet = 0;
/* -------------------------------------------- */

int main3()
{
	// Инициализация и заполнение -- 20 раз значениями от 0 до 29
	std::set<int> S1;
	for (int i = 1; i <= 20; i++)
	{
		S1.insert(rand() % 30);
	}
	/* -------------------------------------------- */



	// Функция вывода каждого элемента в консоль
	auto printSet = [](const int& elem)
	{
		std::cout << elem << " ";
		sumSet += elem;
	};
	/* -------------------------------------------- */



	// Вывод в консоль
	std::cout << "{ ";
	std::for_each(S1.begin(), S1.end(), printSet);
	std::cout << "}" << "\n\n";

	std::cout << "Количество элементов std::set : " << S1.size() << '\n';
	std::cout << "Сумма элементов std::set : " << sumSet << '\n';
	/* -------------------------------------------- */

	std::cout << std::endl;

	return 0;
}